app/controllers/survey_controller.rb

INSERT INTO "survey_sets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "new"], ["created_at", "2016-09-15 10:48:00.331380"], ["updated_at", "2016-09-15 10:48:00.331380"]]
---
	def create
		@survey = SurveySet.new(sur_params)
		if @survey.save

SELECT "ques".* FROM "ques" WHERE "ques"."SurveySet_id" = ?  [["SurveySet_id", 1]]
SELECT  "survey_sets".* FROM "survey_sets" WHERE "survey_sets"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@questions = Que.where(SurveySet_id: params[:id])
		@survey= SurveySet.find(params[:id])

SELECT  "survey_sets".* FROM "survey_sets" LIMIT 30 OFFSET 0
---
	def index
		@surveys = SurveySet.paginate(page: params[:page])

SELECT  "survey_sets".* FROM "survey_sets" WHERE "survey_sets"."id" = ? LIMIT 1  [["id", 9]]
---
	def add_question
		@survey= SurveySet.find(params[:id])

INSERT INTO "ques" ("category", "desc", "a", "b", "c", "d", "SurveySet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["category", "mcq_s"], ["desc", "W"], ["a", ""], ["b", ""], ["c", ""], ["d", ""], ["SurveySet_id", 10], ["created_at", "2016-09-15 11:45:50.142753"], ["updated_at", "2016-09-15 11:45:50.142753"]]
---
	def create_question
		temp = Que.new()
		temp.category = params[:question][:category]
		temp.desc = params[:question][:desc]
		temp.a = params[:question][:a]
		temp.b = params[:question][:b]
		temp.c = params[:question][:c]
		temp.d = params[:question][:d]
		temp.SurveySet_id= params[:question][:id]
		if(params[:question][:over] == '0')
			if temp.save()

INSERT INTO "resps" ("Que_id", "response", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Que_id", 1], ["response", "Hello bhai "], ["User_id", 0], ["created_at", "2016-09-14 19:31:18.207415"], ["updated_at", "2016-09-14 19:31:18.207415"]]
---
	def save
		params[:response].each do |value, resp|
			if(resp[:category]!="mcq_m")
				temp = Resp.new()
				temp.Que_id = resp[:id]
				temp.response = resp[:response]
				temp.User_id = resp[:user]
				puts(temp)
				temp.save()

UPDATE "resps" SET "response" = ?, "updated_at" = ? WHERE "resps"."id" = ?  [["response", "b"], ["updated_at", "2016-09-14 21:00:26.987486"], ["id", 16]]
---
					temp.Que_id = resp[:id]
					temp.User_id = resp[:user]
					temp.response = resp[:response3]
					temp.save()

SELECT  "resps".* FROM "resps" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "resps"
---
	def display_responses
		@responses = Resp.paginate(page: params[:page])

SELECT  "survey_sets".* FROM "survey_sets" WHERE "survey_sets"."id" = ? LIMIT 1  [["id", 20]]
---
	def edit
		@survey = SurveySet.find(params[:id])

DELETE FROM "survey_sets" WHERE "survey_sets"."id" = ?  [["id", 20]]
SELECT  "survey_sets".* FROM "survey_sets" WHERE "survey_sets"."id" = ? LIMIT 1  [["id", 20]]
---
	def destroy
		SurveySet.find(params[:id]).destroy