app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		if !correct_user && !admin_user
			flash[:danger] = "You don't have permission to access the requested url"
			render 'index'
		else
			@user = User.find(params[:id])